app/Controllers/ReservaController.php

    public function agregar_actividades()
    {
        if ($this->request->isAJAX()) {
            $data = $this->request->getPost('data');

            $Actividades = new Actividades();
            $dataActividad = $Actividades->getActividaPrecio($data['id']);

            if (!isset($data['numero']) || $data['numero'] <= 0) {
                $resp['clase'] = "warning";
                $resp['msj'] = "Para reservar la actividad el número de personas debe ser mayor a cero.";
                echo json_encode($resp);
                return;
            }

            $Reservaciones = new Reservaciones();

            $arrSave["id"] = "";
            $arrSave["id_actividad"] = $data['id'];
            $arrSave["num_personas"] = $data['numero'];
            $arrSave["precio"] = str_replace(array(',', '$'), array(''), $dataActividad['0']->precio) * $data['numero'];
            $arrSave["fecha"] = date("Y-m-d H:i:s");
            $arrSave["fecha_realizacion"] = $dataActividad['0']->fecha_inicial;

            //$this->log($arrSave);
            $Reservaciones->insert($arrSave);
---
INSERT INTO `reservaciones` (`id`, `id_actividad`, `num_personas`, `precio`, `fecha_realizacion`, `created_at`, `updated_at`) VALUES ('', '3', '2', 20000, '2022-05-01 16:17:05', '2022-05-07 20:17:08', '2022-05-07 20:17:08')